Repository: ynikitenko/lena
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Tutorial
ru: Пособие

source: Reference
ru: Руководство

source: Contents:
ru: Содержание:

source: Overview
ru: Обзор

source: Lena is an architectural framework for data analysis. It is written in a popular programming language Python and works with Python versions 2, 3 and PyPy (2 and 3).
ru: Lena - архитектурный фреймворк для анализа данных. Она написана на популярном языке программирования Python (Питон) и работает с версиями Python 2, 3 и PyPy (2 и 3).

source: Lena features from programming point of view include:
ru: Свойства и преимущества Lena с точки зрения программирования включают:

source: simple and powerful programming language.
ru: мощный и простой язык программирования.

source: modularity, weak coupling. Algorithms can be easily added, replaced or reused.
ru: модульность, слабое зацепление (*loose coupling*). Алгоритмы могут быть легко добавлены, заменены или повторно использованы.

source: code reuse. Logic is separated from presentation. One template can be used for several plots.
ru: повторное использование кода. Разделение логики и презентации. Один шаблон может быть использован для нескольких графиков.

source: rapid development. One can run only those elements which already work. During development only a small subset of data can be analysed (to check the code). Results of heavy calculations can be easily saved.
ru: быстрая разработка. Могут быть запущены только те элементы, которые уже работают. Во время разработки можно анализировать только малую часть данных (чтобы проверить работу программы). Результаты сложных вычислений можно легко сохранить.

source: performance. Lazy evaluation is good for memory and speed. Several analyses can be done reading data once. PyPy with just-in-time compiler can be used if needed.
ru: производительность (в плане использования памяти и скорости). Несколько видов анализа могут быть сделаны за одно чтение данных. Может использоваться PyPy с компиляцией "на лету".

source: easy to understand, structured and beautiful code.
ru: понятный, структурированный и красивый код.

source: From data analysis perspective:
ru: С точки зрения анализа данных:

source: comparison of analyses with arbitrary changes (including different input data or algorithms).
ru: сравнение результатов анализа при произвольных изменениях (в том числе для разных входных данных или алгоритмов).

source: algorithm reuse for a subset of data (for example, to see how an algorithm works at different positions in the detector).
ru: переиспользование алгоритма для подмножества данных (например, чтобы увидеть, как алгоритм работает для разных позиций в детекторе).

source: analysis consistency. When we run several algorithms for same data or reuse an algorithm, we are confident that we use same data and algorithm.
ru: согласованность анализа. Когда мы запускаем несколько алгоритмов для одного набора данных или переиспользуем алгоритм, то мы уверены, что используем те же данные и тот же алгоритм.

source: algorithms can be combined into a more complex analysis.
ru: алгоритмы могут быть скомбинированы для более сложного анализа.

source: Lena was created in experimental neutrino physics and is named after a great Siberian river.
ru: Lena была создана при анализе данных в экспериментальной физике нейтрино и названа в честь великой сибирской реки.

source: Installation
ru: Установка

source: Minimal
ru: Минимальная

source: Install the latest official version from PyPI:
ru: Установите последнюю официальную версию из PyPI:

source: Lena core modules have no dependencies except Python standard libraries.
ru: Базовые модули Lena не имеют зависимостей помимо стандартных библиотек Python.

source: Recommended
ru: Рекомендуемая

source: *jinja2* is used to create templates for plots. Also install the following programs:
ru: *jinja2* используется для создания шаблонов графиков. Также установите следующие программы:

source: *pdflatex* to produce pdf files from LaTeX,
ru: *pdflatex* для создания pdf-файлов из LaTeX,

source: *pgfplots* and *TikZ* to produce LaTeX plots,
ru: *pgfplots* и *TikZ* для создания графиков в LaTeX,

source: *pdftoppm* to convert pdf files to png.
ru: *pdftoppm* для преобразования pdf-файлов в png.

source: These programs can be found in your OS packages. For example, in Fedora Core 29 install them with
ru: Эти программы можно найти в пакетах вашей операционной системы. Например, в Fedora Core 29 установите их с помощью

source: *pdflatex* and *pgfplots* are contained in the standard `TeX Live <https://www.ctan.org/pkg/texlive>`_ distribution.
ru: *pdflatex* и *pgfplots* содержатся в стандартном дистрибутиве `TeX Live <https://www.ctan.org/pkg/texlive>`_.

source: Full
ru: Полная

source: This installation is needed only if you want to extend and develop Lena. Download the full repository (with history) from GitHub and install all development dependencies:
ru: Эта установка требуется только если вы хотите расширять и разрабатывать Lena. Скачайте полный репозиторий (с историей) с GitHub и установите все зависимости для разработки:

source: Install command line programs from the previous subsection and adjust PYTHONPATH as shown in the next subsection.
ru: Установите программы из предыдущего подраздела и измените PYTHONPATH как показано в следующем подразделе.

source: GitHub or PyPI
ru: GitHub или PyPI

source: PyPI contains the last official release, which was tested for more Python versions. GitHub contains the most recent development code for experienced users. Usually it is well tested too, but there is a chance that a newly introduced interface will be changed.
ru: PyPI содержит последний официальный релиз, который был протестирован для большего числа версий Python. GitHub содержит последний разрабатываемый код для продвинутых пользователей. Обычно он также хорошо протестирован, но есть шанс, что впервые введённый интерфейс может быть изменён.

source: For most users *pip* install should be easier. If for some reasons you can't do that, you can get an archive of an official release from GitHub `releases <https://github.com/ynikitenko/lena/releases>`_.
ru: Для большинства пользователей установка из *pip* должна быть проще. Если по каким-то причинам вы не можете это сделать, вы можете получить архив официального релиза из `релизов <https://github.com/ynikitenko/lena/releases>`_ GitHub.

source: *pip* installs the framework into a system directory, while to install with *git* you need to adjust the PYTHONPATH. Add to your profile (e.g. ``.profile`` or ``.bashrc`` on Linux)
ru: *pip* устанавливает фреймворк в системную директорию, в то время как для установки с *git* вам нужно поменять PYTHONPATH. Добавьте в ваш профиль (например, ``.profile`` или ``.bashrc`` в Linux)

source: export PYTHONPATH=$PYTHONPATH:<path-to-lena>
ru: export PYTHONPATH=$PYTHONPATH:<путь-к-lena>

source: and replace *<path-to-lena>* with the actual path to the cloned repository.
ru: и замените *<путь-к-lena>* на фактический путь к клонированному репозиторию.

source: Documentation
ru: Документация

source: To get started, read the :doc:`tutorial`.
ru: В начале работы прочтите :doc:`пособие <tutorial>`.

source: Complete documentation for Lena modules can be found in the :doc:`reference`.
ru: Полная документация модулей Lena находится в :doc:`руководстве <reference>`. |br| *Примечание*. В данный момент на русский язык переведена лишь первая часть пособия, https://habr.com/ru/post/490518/

source: License
ru: Лицензия

source: Lena is free software released under `Apache <https://github.com/ynikitenko/lena/blob/master/LICENSE>`_ software license (version 2). You can use it freely for your data analysis, read its source code and modify it.
ru: Lena - это свободное программное обеспечение, опубликованное под лицензией `Apache <https://github.com/ynikitenko/lena/blob/master/LICENSE>`_ (версия 2). Вы можете свободно использовать её для своего анализа данных, читать её исходный код и изменять его.

source: It is intended to help people in data analysis, but we don't take responsibility if something goes wrong.
ru: Она предназначена помочь людям при анализе данных, но мы не несём ответственности, если что-то пойдёт не так.

source: Alternatives
ru: Альтернативы

source: `Ruffus <http://www.ruffus.org.uk/index.html>`_ is a Computation Pipeline library for Python used in science and bioinformatics. It connects program components by writing and reading files.
ru: `Ruffus <http://www.ruffus.org.uk/index.html>`_ — вычислительный конвейер (*computational pipeline*) для Python, используемый в науке и биоинформатике. Он объединяет компоненты программы через запись и чтение файлов.
