Repository: ynikitenko/lena
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial/answers.po
Languages: ru

source: Answers to exercises
ru: Ответы на упражнения

source: Part 1
ru: Часть 1

source: Ex. 1
ru: Упр. 1

source: *End.run* in this case is not a generator. To make it a generator, add a *yield* statement somewhere. Also note that since Python 3.7 all *StopIteration* are considered to be errors according to PEP 479. Use a simple *return* instead. This is the implementation in *lena.flow*:
ru: *End.run* в данном случае не генератор. Чтобы сделать его генератором, добавьте где-нибудь инструкцию *yield*. Также заметьте, что с версии Python 3.7 все *StopIteration* считаются ошибками, в соответствии с PEP 479. Используйте вместо этого просто *return*. Вот реализация в *lena.flow*:

source: class End(object): """Stop sequence here.""" def run(self, flow): """Exhaust all preceding flow and stop iteration (yield nothing to the following flow). """ for val in flow: pass return # otherwise it won't be a generator yield "unreachable"
ru: class End(object): """Stop sequence here.""" def run(self, flow): """Exhaust all preceding flow and stop iteration (yield nothing to the following flow). """ for val in flow: pass return # иначе это не будет генератор yield "unreachable"

source: Ex. 2
ru: Упр. 2

source: >>> def my_generator(): ... print("enter my generator") ... yield True ... >>> results = my_generator() >>> list(results) enter my generator [True]
ru: >>> def my_generator(): ... print("входим в мой генератор") ... yield True ... >>> results = my_generator() >>> list(results) входим в мой генератор [True]

source: Ex. 3
ru: Упр. 3

source: An implementation of *Count* is given below. An important consideration is that there may be several *Counts* in the sequence, so give them different names to distinguish.
ru: Реализация *Count* дана ниже. Важное соображение, что в последовательности могут быть несколько *Count*, поэтому дайте им разные имена чтобы отличить.

source: class Count(object): """Count items that pass through. After the flow is exhausted, add {*name*: count} to the *context*. """ def __init__(self, name="counter"): """*name* is this counter's name.""" self._name = name self._count = 0 self._cur_context = {} def run(self, flow): """Yield incoming values and increase counter. When the incoming flow is exhausted, update last value's context with *(count, context)*. If the flow was empty, nothing is yielded (so *count* can't be zero). """ try: prev_val = next(flow) except StopIteration: # otherwise it will be an error since PEP 479 # https://stackoverflow.com/a/51701040/952234 return # raise StopIteration count = 1 for val in flow: yield prev_val count += 1 prev_val = val val = prev_val data, context = lena.flow.get_data(val), lena.flow.get_context(val) context.update({self._name: count}) yield (data, context)
ru: class Count(object): """Count items that pass through. After the flow is exhausted, add {*name*: count} to the *context*. """ def __init__(self, name="counter"): """*name* is this counter's name.""" self._name = name self._count = 0 self._cur_context = {} def run(self, flow): """Yield incoming values and increase counter. When the incoming flow is exhausted, update last value's context with *(count, context)*. If the flow was empty, nothing is yielded (so *count* can't be zero). """ try: prev_val = next(flow) except StopIteration: # иначе это будет ошибка после PEP 479 # https://stackoverflow.com/a/51701040/952234 return # raise StopIteration count = 1 for val in flow: yield prev_val count += 1 prev_val = val val = prev_val data, context = lena.flow.get_data(val), lena.flow.get_context(val) context.update({self._name: count}) yield (data, context)

source: Ex. 4
ru: Упр. 4

source: A simple output function could be the following:
ru: Простая функция вывода может быть следующей:

source: def output(output_dir="output"): writer = lena.output.Writer(output_dir) s = lena.core.Sequence( lena.output.ToCSV(), writer, lena.context.Context(), lena.output.RenderLaTeX(), # initialize properly here writer, lena.output.LaTeXToPDF(), lena.output.PDFToPNG(), ) return s
ru: def output(output_dir="output"): writer = lena.output.Writer(output_dir) s = lena.core.Sequence( lena.output.ToCSV(), writer, lena.context.Context(), lena.output.RenderLaTeX(), # инициализируйте здесь корректно writer, lena.output.LaTeXToPDF(), lena.output.PDFToPNG(), ) return s

source: Then place *output()* in a sequence, and new initialized elements will be put there.
ru: Затем поместите *output()* в последовательность, и новые инициализированные элементы будут в неё помещены.

source: This approach is terse, but less flexible and explicit. In practice verbosity of several output elements was never a problem for the author.
ru: Этот подход краток, но он менее гибкий и явный. На практике детализация из нескольких выходных элементов никогда не была проблемой для автора.

source: Ex. 5
ru: Упр. 5

source: The author is unaware of a simple for a user way to stop a function and resume it at the given point. Inform the author if you know better answers to any of these exercises.
ru: Автору неизвестен простой для пользователя способ остановить функцию и возобновить её в заданной точке. Сообщите автору, если вы знаете лучшие ответы на любое из этих упражнений.

source: Mikhail Zelenyi gives this `explanation <https://habr.com/ru/post/490518/#comment_21342580>`_ (translated from Russian):
ru: Михаил Зелёный даёт такое `объяснение <https://habr.com/ru/post/490518/#comment_21342580>`_:

source: There are two types of models: push and pull. If you have a sequence, then in the case of a *push* model the calculations are initiated by the first member of the sequence, which pushes data further. In this case a fork can be done easily, just at a certain moment it pushes data not into one sequence, but into two.
ru: Есть два типа моделей: push и pull. Если у вас есть цепочка, то в случае *push* модели вычисления инициирует первый член цепочки, и он пихает данные дальше. В данном случае ветвление (форк) делается легко, он просто в определённый момент пихает данные не в одну цепочку, а в две.

source: In the case of a *pull* model the calculations are initiated by the last member of the sequence. Consequently, if we want to branch the sequence, we need to think what to do: to start only when all consumers asked, to use a buffer, or to start with one consumer and to push data into the others conforming to the *push* model.
ru: В случае pull модели вычисления инициирует последний член цепочки. Соответственно, если мы хотим разветвить цепочку, то уже надо думать, что делать: или запускать только когда запросили все потребители, или делать буферизацию, или стартовать с одного потребителя, а в остальные пропихивать данные по push модели.

source: Part 2
ru: Часть 2
